---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.IsEnabled
source: html/5561111d-a66d-9274-461c-84816d9ff323.htm
---
# Autodesk.Revit.DB.TableCellStyle.IsEnabled Property

Gets or sets the status whether this cell is enabled.

## Syntax (C#)
```csharp
public bool IsEnabled { get; set; }
```